Easy 
1.Данные это факты, цифры текста или значения которые можно хранить анализировать и обрабатывать. 
База данных - организованная структура данных предназначенная для хранения управления и извлечения данных
Реляционная база данных - База данных основанная на таблицах, между которыми могут быть связи или отношения. Примеры sql server, Mysql
Таблица это основная структура хранения данных в реляционный БД. Состоит из строк и столбцов можно сказать что также как в экзель
2. Перечисляем 5 ключевых функций SQL SERVER 
1-Хранение и управление связанными таблицами
2-Поддержка расширение SQL от MICROSOFT
3- Безопасность данных
4-резервное копирование и восстановление баз данных
5- поддержка хранимых процедур, триггеров представления индексов и функций
3. 1-внутренняя аутентификация средствами SQL server authentication 
2- Windows аутентификация
3- microsoft entra
4. DONE
5. DONE
6. SQL SERVER это система управления базами данных а SSMS это графическая оболочка для работы с SQL SERVER. Там можно писать запросы и управлять базами. SQL это язык запросов и язык для работы с СУБД 
7. DQL - это запрос данных то есть здесь можно показать SELECT FROM и другие функции
DTM это вставка изменение обновление и удаление данных все что связано с манипуляцией данных. Сюда можно отнести INSERT, UPDATE, DELETE.
  DDL- создание объекта изменение структуры удаление объекта и данных сюда относиться- create, alter, drop и truncate
Dcl управление доступом такие как GRANT и REVOKE назначить и убрать права
TCL Управление транзациями это как начать транзакцию, подтвердить изменение и отменение изменений.
8. Сделано
9. Скачал файл поместил по адресу C:\Program Files\Microsoft SQL Server\MSSQL16.MSSQLSERVER\MSSQL\Backup далее зашел в SSMS нажал вторую мышку на базу данных и нажал восстановить базу данных потом выбрал источником устройства выбрал свой файл и восстановил
